In [8]:

import sqlite3;
import pandas as pd;

In [9]:
conn = sqlite3.connect(':memory:');

In [10]:
cursor = conn.cursor();

In [11]:
cursor.execute('''CREATE TABLE clientes (
    nome TEXT,
    idade BIGINT,
    quantidade BIGINT,
    total FLOAT
    )
''');

In [12]:
df = pd.read_sql_query("SELECT * FROM clientes", conn)

In [13]:
print(df)

Empty DataFrame
Columns: [nome, idade, quantidade, total]
Index: []

In [14]:
cursor.execute(""" INSERT INTO clientes VALUES ('Talysson', 21, 3, 2.5)
""")

In [15]:
df = pd.read_sql_query("SELECT * FROM clientes", conn)

In [16]:
display(df)

       nome  idade  quantidade  total
0  Talysson     21           3    2.5

In [17]:
cursor.execute(""" INSERT INTO clientes VALUES ('Talysson', 23, 3, 2.5)
""")

In [18]:
df = pd.read_sql_query("SELECT * FROM clientes", conn)

In [19]:
display(df)

       nome  idade  quantidade  total
0  Talysson     21           3    2.5
1  Talysson     23           3    2.5

In [20]:
cursor.execute('''CREATE TABLE clientes_novo (
    nome TEXT,
    idade BIGINT,
    quantidade BIGINT,
    total FLOAT
    )
''');

In [21]:
cursor.execute(""" DROP TABLE clientes """)
df = pd.read_sql_query("SELECT * FROM clientes_novo", conn)
print(df)

Empty DataFrame
Columns: [nome, idade, quantidade, total]
Index: []

In [22]:
cursor.execute("""ALTER TABLE clientes_novo RENAME TO clientes""")

In [23]:
cursor.execute(""" INSERT INTO clientes VALUES ('Talysson', 21, 3, 2.5)""")
cursor.execute(""" INSERT INTO clientes VALUES ('Teste 02', 22, 4, 7.5)""")
cursor.execute(""" INSERT INTO clientes VALUES ('Teste 03', 23, 5, 8.5)""")

In [24]:
df = pd.read_sql_query("SELECT * FROM clientes", conn)
display(df)

       nome  idade  quantidade  total
0  Talysson     21           3    2.5
1  Teste 02     22           4    7.5
2  Teste 03     23           5    8.5